In [1]:
import pandas as pd

print(pd.__version__)

2.2.0

C:\Users\corne\AppData\Local\Temp\ipykernel_49224\2433589665.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [2]:
data = {'nama': ['Neil', 'Ray', 'Puri', 'Jessica'],
       'jenis_kelamin': ['L', 'L', 'P', 'L'],
       'usia': [23, 21, 22, 25]}

df = pd.DataFrame(data)
df

      nama jenis_kelamin  usia
0     Neil             L    23
1      Ray             L    21
2     Puri             P    22
3  Jessica             L    25

In [3]:
usia = df.pop('usia').to_frame()

In [4]:
df

      nama jenis_kelamin
0     Neil             L
1      Ray             L
2     Puri             P
3  Jessica             L

In [5]:
usia

   usia
0    23
1    21
2    22
3    25